Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Returnee of the Fallen Family (멸망한 가문의 회귀자).tmx
Source language: ko_kr
Languages: en_us

source: 로건의 검이 번개처럼 휘둘러지자, 검에서 뿜어진 황금빛이 일렁이는 파도처럼 연달아 전면으로 쏘아졌다.
en_us: Logan swung his sword like lightning and the golden light emitted from his sword formed into rolling tides, and crashed forward in succession.

source: 푸우욱.
en_us: Stab.

source: “교육과 훈련?{j}어, 저한테 말입니까?”
en_us: “Train an army? Are you sure you have the right person?”

source: “조금은 알고 있습니다.”
en_us: “I know a little.”

source: 확신할 수 있었다.{j}비루한 재능으로 열등감과 자괴감을 키워 가던 둔재는 더 이상 없다는 것을.
en_us: He no longer felt the inferiority and the shame from his mediocre ability that he locked up inside for all those years.

source: “퉤.{j}아주 곱게 자란 티가 줄줄 나네.”
en_us: “I can smell his pretty hair and his rich clothes from here.”

source: 신음?
en_us: A groan?

source: “그 망나니가?!”
en_us: “That loser?”

source: ‘각성하자마자 기사 둘을 피해 빠져나왔다고?’
en_us: He went past two knights as soon as he awakened?

source: 로건은 당장이라도 그리 외치고 싶었지만, 공식 석상에서 입에 담을 수는 없는 말이었다.{j}그렇기에 로건은 기사 가문에 먹혀들 수밖에 없는 다른 이유를 들먹였다.
en_us: Logan wanted to shout out the truth but he knew he couldn’t be so bold in public. That was why Logan baited his father with a justification tailored for a house of knights.

source: “로건!!”
en_us: “Logan!”

source: 시비를 걸어 댔던 주제에 많은 수련 기사들 앞에서 가문의 직계 혈족을 향해 욕설을 뱉어 낼 배짱은 없는 것이다.
en_us: Even he, who had started the ordeal, didn’t have the guts to openly disrespect an immediate family member of the house in front of the other knights.

source: “그래, 도미넌.{j}너는 이미 사장된 가법을 빌미로 나를 모욕했다.”
en_us: “Right, Dominan, you’ve insulted my honor by abusing an antiquated household law.”

source: 과거를 후회하며.
en_us: Regretting the past.

source: ‘살살 구슬려야 해.{j}살살…….’
en_us: Nice and easy now, Dwain. Nice and easy.

source: ‘어찌 되었건 가문의 주력은 기사단이다.{j}다른 사람은 몰라도 이들의 마음은 얻어 놔야 해.’
en_us: The main force in our house are the knights. I have to win them over regardless of what the others think.

source: “아냐!{j}아냐!”
en_us: “No! No!”

source: 환하게 웃는 로니안의 모습에서 성취를 자랑하고 싶은 순수한 마음이 고스란히 느껴졌다.{j}그리고 그의 의도대로 로건은 순수하게 감탄하고 말았다.
en_us: Logan felt his half-brother’s innocent desire to show him that he had awakened the force from his pure, sweet smile. Logan responded in kind and felt nothing but admiration for his half-brother.

source: 갑작스레 불어난 힘에 온몸이 떨릴 지경이었다.{j}거기다 포스가 질적으로도 성장한 것이 느껴졌다.{j}더욱 끈끈하고 촘촘해진 느낌은 단순한 양적인 성장 이상의 효율을 보여 줄 것이라는 확신이 들었다.{j}더구나 2성을 이루었다는 것은 비전의 다음 비기를 익힐 기본이 갖춰진 것이기도 했다.
en_us: Logan felt his body was shaking from the sudden rush of power. He felt the quality of the force had also improved. The core clung tighter to his heart and he was convinced that his growth was more than a simple upgrade. Achieving the second level of the force meant he was ready to learn the next secret of the ancient book.

source: 너무 빠른 성취에 로건 스스로가 당혹스러울 정도였다.
en_us: He was taken aback by his sudden achievement.

source: “제가 졌…….”
en_us: “I...yiel...”

source: ‘어찌한다…….’
en_us: What shall I do...

source: 그 표정을 보며 필립이 마지막 남았던 희망마저 꺼트리려는 찰나.
en_us: As Phillip saw the young master’s reaction, he prepared to break the last remaining hope he had.

source: 시간을 가지고 변한 모습을 보여 주면 될 것이다.
en_us: He just needed time to show people he had changed.

source: “……새벽녘에 먼저 용병들과 성문을 나섰습니다.”
en_us: “He left in the early hours of the morning with his mercenary army...”

source: “그러니 일단 여기에서 내가 시키는 일부터 해 줬으면 해.”
en_us: “That’s why I need you take care of things for me here.”

source: “아직 아니야.{j}기다려.”
en_us: “It’s not the time. Wait.”{j}

source: ‘교관부터 구해야지.{j}아니, 지금은 호위구나.’
en_us: First, I need a military leader, a condottiere. Well, he’ll act as a bodyguard until we get out this place.

source: “아, 이런.{j}미안하군.{j}내가 말을 너무 막 했어.”
en_us: “Right. My apologies for the barrage of insults. I’ve overstepped.”

source: “오늘부터 로건 대공자가 우리 기사단 훈련에 참여하게 되었다.”
en_us: “Master Logan will be training with us from today.”

source: ‘이 정도였나?{j}이건 좀 곤란한데…….’
en_us: Was it this bad? This is problematic...

source: 꾸욱.
en_us: Squeeze.

source: “뭐 어때.{j}훈련은 편해지겠네.”
en_us: “Who cares? At least training will be easier.”

source: “설마 우리한테 사기를 친 건 아니겠지?”
en_us: “You don’t think they’ve cheated us, do you?”

source: “그, 그렇다!{j}아무리 주인이라도 장인의 자존심을…….”
en_us: “That’s right! I know you are the master but hurting the pride of a master engineer...”

source: “그게 무슨 헛소…….”
en_us: “What kind of horse sh...”

source: “……몸조심하시길 바랍니다, 대공자.”
en_us: “Take good care of yourself, master.”

source: 불쾌한 비명과 함께 하이에나를 닮은 최하급 몬스터, 크롤들이 떼죽음을 당했다.{j}일제 사격 한 번으로 100마리는 넘을 듯한 크롤 무리의 절반 이상을 잡은 것이다.
en_us: Krolls were a sub-level monster that resembled hyenas and possessed a screeching scream. A pack of about a hundred krolls were showered with bolts and the single attack managed to wipe out half of them.

source: 난폭함의 상징과도 같았던 전생의 빅토르지만, 지금껏 지켜본 바로는 그것이 본래의 성격은 아닌 듯했다.
en_us: Victor was the embodiment of pure violence in his previous life but the the boy he was training didn’t seem to have that in his nature.

source: “괜찮으십니까, 아가씨?”
en_us: “Are you alright, my Lady?”

source: “용병대 모두 석궁 장비시키고 출진 준비해.{j}영지 밖, 남부 산맥의 바로 아래까지 마주치는 모든 몬스터를 청소한다.”
en_us: “Arm the men with the crossbow and prepare them for battle. We’ll venture outside of the territory and wipe out any and all monsters we come across at the bottom of the Southern Alps.”

source: 와장창창.
en_us: Crash

source: 살짝 열린 방문.
en_us: A slightly opened door.

source: 신음성과 함께 가족이 와도 알아보지 못할 고깃덩어리 하나가 무너져 내렸다.
en_us: Sir Dominan was no longer recognizable, not even to his own family, and he dropped to the ground, looking like a slab of meat.

source: 패드릭과 헤인켈의 대화에는 긴장감이 묻어났다.{j}하지만 속내와 달리 영지민을 돌아보는 그들의 얼굴은 평온하기만 했다.{j}병력과 영지민의 불안감을 조금이나마 달래기 위한 가장된 모습이었다.{j}하지만 그 여유로운 표정은 성문을 나선 지 얼마 되지 않아 바로 사라졌다.
en_us: The exchange between Padrick and Sir Heinkel was filled with tension but they didn’t show their nerves in front of the peasants. They maintained their composure in an effort to ease the uncertainty of the peasants and soldiers what little they could. But Padrick’s calm demeanor disappeared not long after they had passed through the castle gate.

source: ‘그래서 자신이 있으셨나 보군.’
en_us: Let’s see what you got, Mr. Confident.

source: “자, 다시!{j}발동작이 조금 틀렸다.{j}오늘 목표는 완벽하게 100번을 시연하는 것이다!{j}그전에 밥은 없다!”
en_us: “Again! Your feet were off. Today’s goal is to do the move perfectly a hundred times! No supper until you’re done!”

source: “그동안 제 노력이 너무 부족했음을 깨달았습니다.{j}늦었지만 이제라도 정신을 차려 보려 합니다.”
en_us: {j}“I realized I haven’t been trying hard enough. It may be too late but I want get my act together now.”

source: 그래서 마지막으로 바랐다.
en_us: So, I made a final prayer.

source: ‘내가 너 때문에 여자를 못 믿게 됐다.{j}이 빌어먹을 년아.’
en_us: I never trusted another woman again because of you, lying bitch.

source: 로건은 그렇게 애써 마음을 다잡으며 표정을 다스렸다.{j}그렇게 잠시 어색한 시간이 지나자, 한숨 섞인 목소리가 들렸다.
en_us: Logan tried his best to maintain his composure. The initial awkwardness from Logan’s revelation had passed and Phillip spoke first to express his regret, or perhaps, his relief.

source: 귀한 전력인 기사들 중에서도 극소수만이 달성한 경지의 강자가 바로 그였다.{j}보통 포스유저 중급, 중급기사의 경지에만 올라도 웬만한 기사단의 수위 기사급으로 인정받는다.{j}상급기사는 그런 수위 기사급 강자를 열 명 이상 상대할 수 있는 전력으로 평가되었다.
en_us: Knights were rare enough but men of his caliber and power were even rarer. Only a handful of men had reached his level of power. Becoming a mid-level force user, hence a middle knight, was enough to be hailed as one of the top knights in most orders. While a high knight was powerful enough to hold his own against ten middle knights.

source: 로건이 속으로 이를 갈았지만, 아버지의 태도는 굳건했다.{j}문제는 그것뿐만이 아니었다.
en_us: Logan was livid with how his plan turned out but his father remained firm. His father wasn’t the only problem.

source: 더구나.
en_us: Also...

source: “야, 저기 봐.”
en_us: “Hey, look over there.”

source: “그렇지만…….”
en_us: “But still...”

source: 거래를 할 때는 급한 모습을 보이는 쪽이 불리한 법이지만 지금 상황은 좀 달랐다.{j}주변의 모두가 주목하고 있었고, 간접적으로나마 무력의 우위를 보이고 거래 대상의 기를 질리게 한, 다시 말해 심리적 우위가 확실한 상황이었다.{j}그러나 매부리코는 그래도 노예 시장에서 굴러 온 경험이 있어서인지 쉽게 넘어가지 않았다.
en_us: A buyer in a hurry would usually be at a disadvantage but not under the situation as it were. The slave trader had attracted too much attention and Logan’s party had indirectly showed their superior strength, meaning that they had psychological upper hand. But the hooked-nosed man seemed to be a seasoned trader in these parts and didn’t collapse under the pressure.

source: 2화
en_us: Chapter Two

source: 어린 시절부터 자신의 전담 시종이었던 릭은 그가 조금만 움직여도 호들갑을 떨었다.
en_us: Rick was quick to make a fuss over Logan’s health ever since he was a boy.

source: “예.
en_us: “Of course.

source: 로건의 입장에서는 가장 합리적으로 내린 판단이었지만 당연히 패드릭은 그렇게 생각하지 않았다.
en_us: From Logan’s point of view, his decision was the most logical but Padrick thought otherwise.

source: 거기다 이공자가 고작 열네 살의 나이라는 것이 소문에 살을 보탰다.
en_us: Also, the fact that the younger son was fourteen added more meat to the bones.

source: “……뭐 잘못 드셨어요?”
en_us: “...Did you eat something wrong this morning?”

source: “거, 조심 좀 합시다.”
en_us: “You should be more careful.”

source: “흐음.{j}그런 획기적인 무기에 추가되는 것이 카트리지 하나, 거기다 부품이 태엽과 아교에 활줄뿐이라…….{j}이거 도전의욕이 나는군요.{j}좋습니다.{j}만들어보지요.”
en_us: “Hmm. A revolutionary weapon only needs a cartridge and all I have to make it are arrow strings, springs and glue. I must admit that this awakens my competitive urges. Fine, I’ll make it.”

source: ‘으억!’
en_us: That was close.

source: 로건의 단호한 태도에 드웨인은 머리가 지끈거려 오는 것을 느꼈다.
en_us: Logan’s stubbornness only added more suffering to Dwain’s worn-out mind.

source: 소문이야 어찌 나건, 누가 음모를 꾸미건 당장은 모두 의미 없는 일.
en_us: Rumors or conspiracies didn’t matter at all right now.

source: “아직, 아직이야.”{j}로건의 꽉 깨문 입술에서 피가 흘러내렸다.
en_us: “Not yet.” replied Logan as blood trickled down from his trembling lips.

source: “그럼 결국 아무 이유도 없이 파혼을 통보하러 왔다는 거로 받아들여도 되나요?”
en_us: “Regardless, I highly doubt that you expect us to accept this breach without an explanation.”

source: ‘그게…… 정말 저 녀석인가?’
en_us: Is that really him?

source: “그런데 그런 깨달음을 얻고 나와서 처음으로 한다는 짓이 기사 폭행이냐?”
en_us: “But the first thing you do after your great awakening is to beat up a knight?”

source: 그는 험한 세상에서 10년을 넘게 구른 뒤에야 자신이 얼마나 한심했었는지 깨달았다.
en_us: Over a decade of toiling in the harshness of the world finally made him realize how pathetic he had been.

source: 로건의 새어머니, 즉 로니안의 생모이자 현 맥라인 가문의 안주인이었다.
en_us: She was Logan’s step-mother, meaning, she was also Lonian’s birth mother and the current lady of the house.

source: ‘내 차징을 버텨 낼 수 있다고 생각한다고?{j}감히?!’
en_us: Do they think some shields can withstand my charge? How dare they?{j}

source: “예.”
en_us: “Yes.”

source: 놀랍게도 리이나는 300만 골드라는 거금을 전장을 통한 신용 거래도 아닌 금화 궤짝으로 그 자리에서 지급했다.
en_us: Logan was surprised that Lina didn’t use financial intermediary or credit, she immediately paid the full amount with a chest full of gold coins.

source: “왜 내성에 거지를…….”
en_us: “A beggar within the castle walls...”

source: 그리고 미친놈이랑 대화를 길게 하는 것만큼 어리석은 짓은 없다.{j}하지만.
en_us: There was nothing more foolish than spending a long conversation with a lunatic but he piqued his interest.

source: 가능하면 계속 웃으며 얘기하고 싶었는데.
en_us: Logan wanted to maintain his smile.

source: ‘그러니 이놈은 미친놈이 확실하다.’
en_us: He is crazy for sure.

source: “으아아!”
en_us: “Ahh!”

source: “내가 돈을 뿌려가며 여러분을 불러 모은 이유가 궁금한 사람이 많을 것이다.”
en_us: “I’m sure many of you are wondering why I’ve splashed my own money to bring you here.”

source: 그 모든 인생의 순간 마음에 드는 것은 그나마 마지막 죽음뿐이었다.
en_us: The only part of my life worth anything was my ultimate death.

source: 확 달라진 감각과 육체로도 석 달 내내 실패만 거듭했던 비기.
en_us: He had failed to perform this technique over and over for the last three months despite his enhanced senses and body.

source: 가솔들의 수군거림은 9할이 그를 향한 비난이었다.{j}뻔뻔하게 미안한 표정을 짓고 있는 리이나의 표정이 이 상황을 예견한 승리자의 미소처럼 느껴졌다.{j}그 모든 모습이 세차게 그의 머리를 때리고 나서야 로건은 깨달았다.{j}자신이 아직도 안일하게 상황을 보고 있었다는 것을.
en_us: Almost every murmured word that was uttered criticized Logan. The obvious show of sympathy from Lina felt like a winner’s smile who knew how the game would end. Logan felt trapped in a whirlwind of confusion until he realized that he had miscalculated. He had not taken it far enough.

source: ‘아직, 아직인 것이냐.’
en_us: When will they move...

source: “자, 계약하러 갑시다.”
en_us: “Let’s go sign the contract.”

source: 그리고 말년의 그는 죽기 직전까지 이 순간을 후회했다.
en_us: Logan, in his old age, regretted those words until his last dying breath.

source: 하지만 그가 뭐라고 말하기도 전에 부하들이 난장을 피우기 시작했다.
en_us: But the others voiced their disapproval before he could continue.

source: 카일에서 말을 달려 이틀 만에 도착한 중부의 영지 하룬.{j}이곳은 외성에도 두꺼운 성문이 몇십 미터 거리를 두고 두 겹으로 세워져 있었다.{j}때문에 로건은 카일에 들어섰을 때와는 달리 신분패를 보였음에도 이중의 검사를 거쳐야 했다.{j}이렇듯 하룬이 엄중한 경계를 하는 데에는 그럴 만한 이유가 있었다.
en_us: Logan had arrived in Harun, a territory in the middle of the kingdom, after two days of riding. Harun’s thick outer gate was protected by two outer walls that were a small training field apart. Security was tight in the city, which was why Logan had to pass two inspections even with his house badge.

source: ‘너 진짜 미쳤냐?’는 눈빛이었지만 차마 그렇게 말하지는 못하겠는지 필립은 애써 논리정연하게 말했다.
en_us: Phillip seriously questioned Logan’s sanity and wanted to say as much but decided to engage him with a more diplomatic argument.

source: “지금 차였다고 자존심 상해서 객기 부리는 거 같은데.”
en_us: “I think the rejection has hurt his pride and now he’s acting out.”

source: “모두 그만!”
en_us: “Everyone, stop!”

source: 그래선 안 된다.
en_us: That can’t happen.

source: “……아!”
en_us: “Oh.”

source: 지금부터라도 달라진 모습을 보여 준다면 이 관계도 차차 나아질 것이다.
en_us: Logan knew this relationship could also be mended if he showed her how he’d changed.

source: 쉴 새 없이 쏟아진 필립의 말에 로건은 그저 고개를 끄덕일 뿐이었다.
en_us: Logan was overwhelmed by the speed of Phillip’s words and could only nod.

source: “적이다!”
en_us: “It’s the enemy!”

source: 로건이 어딘가의 전쟁을 준비하는 변경백의 자제도 아니고 맥라인 남작가의 대공자라는 사실을 들은 카이는 잠시 놀라기는 했다.{j}하지만 그 사실이 계약에 지장을 주진 못했다.
en_us: Kai was surprised to hear that Logan was the heir of the House of MacLine, a baron-level territory, instead of a frontier territory that was preparing for war. But the contract was too good for Kai to care either way.

source: “사, 살려 주십시오.{j}대공자님!”
en_us: “Spare me, sir!”

source: “파혼의 당사자로서 그 정도 주장은 할 수 있다고 생각합니다.”
en_us: “I felt it was within my right to ask as the offended party of the betrothal.”

source: 하지만 지금은 전생과 달리 로건 자신과 그의 용병대가 있다.
en_us: Logan was stronger than his past self and he also had his mercenary army.

source: 한바탕 소란이 끝난 뒤에야 정식 인사가 시작되었다.{j}준비된 단상 위에 올라선 로건이 담담하게 소개말을 건넸지만, 그가 조금 전 보인 실력 행사로 인해 연병장엔 침묵만이 감돌았다.{j}그 침묵을 즐기며 로건은 다시 입을 열었다.
en_us: An official introduction took place after the commotion had died down. Logan confidently stepped up on to the podium and introduced himself to the crowd, which was met by a silenced crowd that were still in shock from his show of force. Logan took pleasure in the silence and continued his introduction.

source: 리이나와 록페른이 안도의 한숨을 내쉬는데.
en_us: Lina and Lockferan sighed in relief.

source: ‘저런 녀석이 그렇게 변했다면 그럴 만한 이유가 있겠지.{j}아마도…….’
en_us: There must have been a reason why a boy like this turned into such a man...

source: “진짜?!”
en_us: “Really?”

source: 샤샤샥.
en_us: Swish.

source: “뒤, 뒤에도!”
en_us: “They’re coming from behind!”

source: 헤인켈은 처음과는 완전히 다른 따스한 눈으로 로건을 보고 있었다.{j}마치 굴러들어 온 복덩이를 보는 느낌이었다.{j}로건이 바란 인식과는 거리가 있었지만, 확실히 긍정적인 변화임은 틀림없었다.
en_us: Sir Heinkel no longer looked at Logan with contempt but with warmth. The young man’s unexpected influence now felt like a blessing in disguise. Logan had a different change of perception in mind but he couldn’t deny that his new reputation was for the better.

source: “제대로 훈련된 기마병은 보병 셋 이상의 전력으로 취급할 수 있습니다.{j}공자님의 용병들이 그 역할을 할 수 있겠습니까?”
en_us: “A well-trained cavalryman is worth three infantrymen. Are your mercenaries worthy of that statement?”

source: 게다가 처음에 선두에 나섰던 놈도 입가에 피를 훔치며 장검을 꺼내 들었다.{j}위기감이 들자 분노로 뜨거워진 머리에 찬바람이 스며들기 시작했다.{j}방패를 들었던 놈의 말이 다시금 떠올랐다.
en_us: The knight who had blocked Padrick with his shield wiped the blood off his mouth and drew his longsword. A sense of doubt blew a cold breeze into Padrick’s rage-filled head. The words of the knight rang through his head.

source: 그리고 그 예감은 바로 현실이 되었다.
en_us: His fears were realized into reality.

source: “큭!”
en_us: “The audacity...”

source: “혹시 또 주둥이 털고 싶은 놈?”
en_us: “Is there anyone else that wants to run their mouths?”

source: 상황이 이상하게 흘러가는 듯 보이자 리이나가 중간에 끼어들었다.{j}로건의 의견을 받아들일 수도 있다는 것처럼 보이지만, 결국 가주의 권위를 치켜세우는 이야기였다.
en_us: Lina stepped into to control the situation. Her words seemed diplomatic enough but the underlying intention was a reminder that the Baron’s words were the most important.

source: 분명히 오전에 해가 떠오르며 시작한 수련이었는데, 어느새 석양이 지고 있었다.
en_us: Logan swore he started training at sunrise but now the sun was setting.

source: “정말?!”
en_us: “I can’t believe it!”

source: 하마르가 연사 석궁을 제대로 만들지 못할 수도 있고 완성된다 해도 용병대가 제대로 사용하지 못할 수도, 시간이 걸릴 수도 있다.{j}하지만 그렇다고는 해도 그 두 가지는 이미 하마르와 카이에게 맡긴 거나 다름없으니 그가 더 할 수 있는 것은 없었다.
en_us: Hamar might fail to make an automatic crossbow and even if he did, the mercenaries could also fail to learn how to use it or take longer than expected. But the fate of each task were out of his hands but in the respective hands of Hamar and Kai.

source: “흥.{j}내가 노예 원가도 모른다고 생각하는 건가?”
en_us: “Are you questioning my knowledge of the slave trade?”

source: 그리고 기사 수련생이 명목상 ‘상급자’인 기사에게 대련을 신청하는 것은 규정에 어긋나지 않을뿐더러, 오히려 권장되는 것이 전통.
en_us: It was common practice for squires to ask knights to spar, it was in fact a tradition and was highly encouraged.

source: 로건의 의도를 이해하지 못한 카이가 반문했지만, 그는 굳이 설명해 주지 않았다.
en_us: Kai didn’t understand his meaning behind the words but Logan didn’t bother explaining them to him.

source: 파바바박!
en_us: Swoosh.

source: “내가 이곳이 초행길인데, 찾고 있는 사람이 있어서 말이오.”
en_us: “It’s my first time here and I’m looking for someone.”

source: 그런 인물들이 지금은 하나같이 서로 눈에 띄려고 노력하고 있었다.{j}로건에게는 퍽 재밌는 상황이었다.{j}전후 사정을 짐작하는 것은 어렵지 않았다.
en_us: The same characters were now jostling for Logan’s attention. It amused Logan greatly. He knew why they had come to see him.

source: “아, 아니요.
en_us: “I’m afraid I missed it, sir.

source: 하지만 지금과 같은 고행의 순간, 포스코어는 급속도로 힘을 쏟아 내고 회복하기를 반복하며 명상 수련 때보다 확연히 선명해지고 있었다.{j}물론 육체적으로는 피곤했지만, 실시간으로 발전하는 포스코어의 모습에 흐뭇한 미소가 번질 뿐이었다.{j}그렇기에 로건은 진심을 담아 말할 수 있었다.
en_us: But during moments that required immense strength, like the training he was in, his force core pumped out energy and recovered at a rapid rate. His force core was becoming more distinct by the repetition. It did physically drain him but he was thrilled to see his force core improve by leaps and bounds in real time. His improvement was why he was able to truthfully answer to Sir Heinkel.

source: “리아!{j}도망…… 컥!”
en_us: “Ria! Run away...Ahh!”

source: 그것도 그 당시 그대로의 얼굴로.
en_us: Appearing just as Logan remembered all those years ago.

source: ‘……흉기라면 격리해 버리면 되지.{j}왕국의 전력을 깎아 먹지 못하도록.’
en_us: If he proves to be an untamed blade, I’ll lock him away to prevent him from debilitating the kingdom.

source: 그리고 로니안의 저 앳된 얼굴.
en_us: Lonian’s youthful face.

source: ‘그때까지 최소한 이 나라를 움직일 만한 힘을 길러야 한다.’
en_us: I must at least consolidate enough power to influence this nation.

source: “그 집안은 처가에 빌붙어 사는 거지 집안이야.{j}그런데 투자?{j}자기들 빚도 못 갚는 집안이?”
en_us: “That family is only kept alive by the graces of their in-laws. They are beggars. But you wear their emblem and talk about investment? A family that can’t even pay off their own debts?”

source: “나름대로 보람 있는 ‘외출’이었습니다.”
en_us: “It was a rather fruitful trip.”

source: 그 말에 대부분은 고개를 끄덕였다.
en_us: His words were met with nods of approval.

source: 이것이 완성만 된다면 그가 그리는 미래에 큰 도움이 되었다.
en_us: Logan knew that four hundred of Hamar’s crossbows would help turn the tide of the future.

source: 지켜보던 모든 이가 놀라던 그 광경을 뒤로 한 채, 그는 간절한 바람을 담아 기도했다.
en_us: Logan was bewildered by what he had seen but he took a moment to pray, clasping his hands in desperate hope.

source: “로니안?”
en_us: “Lonian, is that you?”

source: “파혼의 대가로 맥라인 가문이 요구하는 것은 오직 한 가지.”
en_us: “I only ask for one thing in exchange for breaking this betrothal.”

source: “아니, 그건 사실이…….”
en_us: “Well, actually the truth is...”

source: 18화
en_us: Chapter Eighteen.

source: “로건 대공자가 그렇게 나올 줄은 예상을 못 했지요.”
en_us: “You had no idea that Master Logan would come out like that.”

source: “로건 님.{j}이게 석궁의 한계입니다.{j}진지하게 쓸 만한 전력을 원하시면 차라리 궁기병 쪽으로…….”
en_us: “Master Logan, you’ve witness the limitations of the crossbow. It’s not too late to change them into mounted archers if you desire a serious army...”

source: 몸은 어떠세요?
en_us: “How are you feeling?”

source: 전신을 점령하는 공포로 몸이 얼어붙었지만, 뒤쪽에서 밀려오는 아군의 움직임에 릭은 의지와 상관없이 전방으로 떠밀렸다.
en_us: Fear seeped into his veins but the onrushing men behind him force Rick helplessly forward.

source: 전생에 이 녀석은 귀족 학살자로 악명을 떨쳤고, 로니안은 최연소 오러유저로 위명을 떨쳤다.{j}그랬기에 전생에서는 둘을 비교해 본다는 생각조차 하지 않았지만…….
en_us: In Logan’s previous life, Victor was infamous for being the Noble Killer while Lonian was hailed as the youngest auror user in history. Logan never thought to compare them in his past life.

source: “……예.”
en_us: “Yes, Father.”

source: 창밖으로 보이는 밝은 햇살과는 반대로, 아직 이 영지의 미래는 캄캄하기만 했다.
en_us: The sun shone brightly into the room but the future of this land was shrouded in darkness.

source: 가볍게 휘두른 검에서 느껴지는 감각과 힘이 이전과 확연히 달랐다.
en_us: The power and the sensation he felt as he lightly swung his sword was totally different than before.

source: “지금이다!”
en_us: “Now is the time!”

source: “공자님이 용병들이 왜 필요하십니까?{j}그것도 그렇게나 많이?”
en_us: “Master, why do you need so many mercenaries?”

source: 가볍게 휘둘러 보았을 뿐인데도 검이 대기를 가르며 강렬한 충격파를 만들어 낸다.{j}고장 1성의 포스코어지만, 그것만으로도 중급기사 수준에 근접하는 힘을 보여 준다.{j}신체를 강화하는 것을 넘어 사물에 그 힘을 불어넣을 수 있다는 포스유저 중급의 경지가 손에 잡힐 듯 다가오고 있었다.{j}미약하게나마 검에 기운을 흘려 보내는 데 성공했으니 시간만 지나면 중급의 경지에 자연스럽게 도달할 듯했다.{j}전신에 충만하게 느껴지는 진화한 포스의 힘.{j}힘의 증폭과 넘치는 치유력은 전생에 터득했던 단순한 포스와는 비교도 할 수 없었다.{j}하급기사라면 일개 조도 혼자 상대할 수 있을 것 같았다.
en_us: It was only a light swing of his sword but it cut through the air with a powerful wave of energy. His force core was only at level one but it generated enough power to almost match the strength of a mid-level knight. Being able to transfer the force on to an object was the skill of a mid-level force user and Logan felt he was a fingertip away from reaching such a level. He had succeeded in imparting a small part of the force on to his sword and knew it was only a matter of time before he reached the level of a mid-level force user. He felt the power of his evolved abilities run throughout his body. His ampliﬁed force power and heightened regeneration felt inﬁnitely stronger than the force he had awakened in his past life. Logan was confident enough to take on a group of low-level knights on his own.

source: “내 팔, 내 팔!”
en_us: “My arm! My arm!”

source: 아이고.
en_us: Oh no.

source: 철저히 이용만 당하다가 비참하게 죽은 것이다.
en_us: He was a mere pawn, used then discarded to die.

source: 마치 당연히 그리되어야 하는 것처럼.
en_us: It was much quicker and easier than expected, it formed as if there was no other option.

source: ‘날 언제 봤다고…….’
en_us: But we’ve never even met!

source: 사람 좋아 보이는 미소를 띠고 있는 뚱보는 페란 도일.{j}병사들의 장비 담당자로, 평상시에는 마주친다 해도 로건의 눈조차 쳐다보지 않은 채 인사도 하는 둥 마는 둥 하고 사라지던 이.
en_us: The jolly fat man was Ferran Doyle. He was in charge of maintaining military equipment. He never made eye contact with Logan when normally would come across and quickly disappeared after he had said a shy hello.

source: 로건의 눈이 절로 커졌다.{j}늙은이의 말대로 드워프 종족은 저 두꺼운 손가락에 어울리지 않는 섬세한 손재주를 타고난 이들이다.{j}유소년기부터 늙어 죽을 때까지 무언가를 만들고 다듬으며 그것에서 삶의 의미를 찾는 종족.
en_us: Logan eyes widened as if he had struck gold. Despite their fat fingers, dwarves were a race of talented craftsmen and engineers. They dedicated their lives to tinkering and inventing various gadgets from a young age until they were on their deathbeds.

source: “내 기사들이 곧 내 칼이다.{j}한 번 받아 보거라, 패드릭 맥라인.”
en_us: “My knights are my sword. Face them if you dare, Padrick MacLine.”

source: 전의를 상실한 도미넌이 항복의 말을 채 내뱉기도 전에 목검이 그의 입을 강타했다.
en_us: Sir Dominan’s fighting spirit had vanished and Logan’s wooden sword struck his before he could declare his surrender.

source: “여기 남부 지방으로 가는 의뢰가…….”
en_us: “A request for men wanting to head south...”

source: “예?{j}어디를…….”
en_us: “Sorry? Where are we...”{j}

source: “반동이 거의 없어!”
en_us: “There is almost no recoil!”
